manoj153/STM32F1BOARD/Src/main.c
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOE, CH6R_2_Pin|CH6R_3_Pin|CH6R_4_Pin|CH1R_2_Pin 
                          |CH1R_1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, RTS_Pin|CH1G_1_Pin|CONN_FAIL_Pin|CH6R_1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, PWR_SYSF_Pin|ASYS_F_Pin|PWR_LED_Pin|RLY1_Pin 
                          |Beep_Pin|TESTpb_Pin|MUTEpb_Pin|CH6G_6_Pin 
                          |CH5R_1_Pin|CH4R_4_Pin|CH4R_3_Pin|CH4R_2_Pin 
                          |CH4R_1_Pin|CH3R_4_Pin|CH3R_3_Pin|CH3R_2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, CH5G_5_Pin|CH4G_4_Pin|CH3G_3_Pin|CH2G_2_Pin 
                          |CH5R_4_Pin|CH5R_3_Pin|CH5R_2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, CH3R_1_Pin|CH2R_4_Pin|CH2R_3_Pin|CH2R_2_Pin 
                          |CH2R_1_Pin|CH1R_4_Pin|CH1R_3_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : CH6R_2_Pin CH6R_3_Pin CH6R_4_Pin CH1R_2_Pin 
                           CH1R_1_Pin */
  GPIO_InitStruct.Pin = CH6R_2_Pin|CH6R_3_Pin|CH6R_4_Pin|CH1R_2_Pin 
                          |CH1R_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : ALLGBYP_7_Pin CH6GBYP_6_Pin CH3_2_Pin CH3_3_Pin 
                           CH3_4_Pin CH4_1_Pin CH4_2_Pin CH4_3_Pin 
                           CH4_4_Pin CH5_1_Pin CH5_2_Pin */
  GPIO_InitStruct.Pin = ALLGBYP_7_Pin|CH6GBYP_6_Pin|CH3_2_Pin|CH3_3_Pin 
                          |CH3_4_Pin|CH4_1_Pin|CH4_2_Pin|CH4_3_Pin 
                          |CH4_4_Pin|CH5_1_Pin|CH5_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : CH5GBYP_5_Pin CH4GBYP_4_Pin CH3GBYP_3_Pin CH2GBYP_2_Pin 
                           CH1GBYP_1_Pin CH2_1_Pin CH2_2_Pin */
  GPIO_InitStruct.Pin = CH5GBYP_5_Pin|CH4GBYP_4_Pin|CH3GBYP_3_Pin|CH2GBYP_2_Pin 
                          |CH1GBYP_1_Pin|CH2_1_Pin|CH2_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : RSV_Pin CH1_1_Pin CH1_2_Pin CH1_3_Pin 
                           CH1_4_Pin PMUTEPB_Pin BATT_FAIL_Pin AC_FAIL_Pin */
  GPIO_InitStruct.Pin = RSV_Pin|CH1_1_Pin|CH1_2_Pin|CH1_3_Pin 
                          |CH1_4_Pin|PMUTEPB_Pin|BATT_FAIL_Pin|AC_FAIL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : RTS_Pin CH1G_1_Pin CONN_FAIL_Pin CH6R_1_Pin */
  GPIO_InitStruct.Pin = RTS_Pin|CH1G_1_Pin|CONN_FAIL_Pin|CH6R_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : CH2_3_Pin CH2_4_Pin CH3_1_Pin CH5_3_Pin 
                           CH5_4_Pin CH6_1_Pin CH6_2_Pin CH6_3_Pin 
                           CH6_4_Pin */
  GPIO_InitStruct.Pin = CH2_3_Pin|CH2_4_Pin|CH3_1_Pin|CH5_3_Pin 
                          |CH5_4_Pin|CH6_1_Pin|CH6_2_Pin|CH6_3_Pin 
                          |CH6_4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : PWR_SYSF_Pin ASYS_F_Pin PWR_LED_Pin RLY1_Pin 
                           Beep_Pin TESTpb_Pin MUTEpb_Pin CH6G_6_Pin 
                           CH5R_1_Pin CH4R_4_Pin CH4R_3_Pin CH4R_2_Pin 
                           CH4R_1_Pin CH3R_4_Pin CH3R_3_Pin CH3R_2_Pin */
  GPIO_InitStruct.Pin = PWR_SYSF_Pin|ASYS_F_Pin|PWR_LED_Pin|RLY1_Pin 
                          |Beep_Pin|TESTpb_Pin|MUTEpb_Pin|CH6G_6_Pin 
                          |CH5R_1_Pin|CH4R_4_Pin|CH4R_3_Pin|CH4R_2_Pin 
                          |CH4R_1_Pin|CH3R_4_Pin|CH3R_3_Pin|CH3R_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : CH5G_5_Pin CH4G_4_Pin CH3G_3_Pin CH2G_2_Pin 
                           CH5R_4_Pin CH5R_3_Pin CH5R_2_Pin */
  GPIO_InitStruct.Pin = CH5G_5_Pin|CH4G_4_Pin|CH3G_3_Pin|CH2G_2_Pin 
                          |CH5R_4_Pin|CH5R_3_Pin|CH5R_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : CH3R_1_Pin CH2R_4_Pin CH2R_3_Pin CH2R_2_Pin 
                           CH2R_1_Pin CH1R_4_Pin CH1R_3_Pin */
  GPIO_InitStruct.Pin = CH3R_1_Pin|CH2R_4_Pin|CH2R_3_Pin|CH2R_2_Pin 
                          |CH2R_1_Pin|CH1R_4_Pin|CH1R_3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void dipSWR(void)
{
	dipSW = 0xFFFF;
//	dipSW &= ~~(1 << 6);
//	dipSW &= ~~(1 << 5);
//	dipSW &= ~(1 << 4);
//	dipSW &= ~(1 << 3);
//	dipSW &= ~(1 << 2);
//	dipSW &= ~~(1 << 1);
//	dipSW &= ~(1 << 0);
		//When SW on, Signal HIGH
		dipSW  &= ~(HAL_GPIO_ReadPin(CH1GBYP_1_GPIO_Port, CH1GBYP_1_Pin) << 6);// 7th bith 
		dipSW  &= ~(HAL_GPIO_ReadPin(CH2GBYP_2_GPIO_Port, CH2GBYP_2_Pin) << 5);
		dipSW  &= ~(HAL_GPIO_ReadPin(CH3GBYP_3_GPIO_Port, CH3GBYP_3_Pin) << 4);
		dipSW  &= ~(HAL_GPIO_ReadPin(CH4GBYP_4_GPIO_Port, CH4GBYP_4_Pin) << 3);
		dipSW  &= ~(HAL_GPIO_ReadPin(CH5GBYP_5_GPIO_Port, CH5GBYP_5_Pin) << 2);
		dipSW  &= ~(HAL_GPIO_ReadPin(CH6GBYP_6_GPIO_Port, CH6GBYP_6_Pin) << 1);
		dipSW  &= ~(HAL_GPIO_ReadPin(ALLGBYP_7_GPIO_Port, ALLGBYP_7_Pin) << 0);
}

void readChannel(uint8_t chWhat)
{
	switch (chWhat)
  {
  	case 1U: 
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH1_1_GPIO_Port, CH1_1_Pin))) << 23) ;
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH1_2_GPIO_Port, CH1_2_Pin))) << 22);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH1_3_GPIO_Port, CH1_3_Pin))) << 21);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH1_4_GPIO_Port, CH1_4_Pin))) << 20);
  			break;
  	case 2U:
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH2_1_GPIO_Port, CH2_1_Pin))) << 19);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH2_2_GPIO_Port, CH2_2_Pin))) << 18);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH2_3_GPIO_Port, CH2_3_Pin))) << 17);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH2_4_GPIO_Port, CH2_4_Pin))) << 16);
			
  			break;
	case 3U:
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH3_1_GPIO_Port, CH3_1_Pin))) << 15);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH3_2_GPIO_Port, CH3_2_Pin))) << 14);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH3_3_GPIO_Port, CH3_3_Pin))) << 13);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH3_4_GPIO_Port, CH3_4_Pin))) << 12);
			
			break;
	case 4U:
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH4_1_GPIO_Port, CH4_1_Pin))) << 11);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH4_2_GPIO_Port, CH4_2_Pin))) << 10);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH4_3_GPIO_Port, CH4_3_Pin))) << 9);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH4_4_GPIO_Port, CH4_4_Pin))) << 8);
		
			break;
	case 5U:
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH5_1_GPIO_Port, CH5_1_Pin))) << 7);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH5_2_GPIO_Port, CH5_2_Pin))) << 6);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH5_3_GPIO_Port, CH5_3_Pin))) << 5);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH5_4_GPIO_Port, CH5_4_Pin))) << 4);
		
			break;
		
	case 6U:
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH6_1_GPIO_Port, CH6_1_Pin))) << 3);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH6_2_GPIO_Port, CH6_2_Pin))) << 2);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH6_3_GPIO_Port, CH6_3_Pin))) << 1);
		sensors &= ~((~(	HAL_GPIO_ReadPin(CH6_4_GPIO_Port, CH6_4_Pin))) << 0);
			
			break;

  	default:
  			break;
  }
}

void trigger(void)
{
	//CH6, Green ligth 
	if (((sensors >> 0) & 1) && ((sensors >> 1) & 1 ) && ((sensors >> 2) & 1) && ((sensors >> 3) & 1))
	{
		//Turn ON Green LED for CH6
		HAL_GPIO_WritePin(CH6G_6_GPIO_Port, CH6G_6_Pin, GPIO_PIN_SET);
		//Turn Of Any Red LEDS, System is good.
		HAL_GPIO_WritePin(CH6R_1_GPIO_Port, CH6R_1_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH6R_2_GPIO_Port, CH6R_2_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH6R_3_GPIO_Port, CH6R_3_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH6R_4_GPIO_Port, CH6R_4_Pin, GPIO_PIN_RESET);
	}
	else
	{
		HAL_GPIO_WritePin(CH6G_6_GPIO_Port, CH6G_6_Pin, GPIO_PIN_RESET);
		//Each individual red led trigger CH6-1 -> CH1-1
		if(~(sensors >> 0) & 1)
		{
			HAL_GPIO_WritePin(CH6R_4_GPIO_Port, CH6R_4_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH6R_4_GPIO_Port, CH6R_4_Pin, GPIO_PIN_RESET);
		}
		if(~(sensors >> 1) & 1)
		{
			HAL_GPIO_WritePin(CH6R_3_GPIO_Port, CH6R_3_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH6R_3_GPIO_Port, CH6R_3_Pin, GPIO_PIN_RESET);
		}
		if(~(sensors >> 2) & 1)
		{
			HAL_GPIO_WritePin(CH6R_2_GPIO_Port, CH6R_2_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH6R_2_GPIO_Port, CH6R_2_Pin, GPIO_PIN_RESET);
		}
		if(~(sensors >> 3) & 1)
		{
			HAL_GPIO_WritePin(CH6R_1_GPIO_Port, CH6R_1_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH6R_1_GPIO_Port, CH6R_1_Pin, GPIO_PIN_RESET);
		}
	}
		if (((sensors >> 4) & 1) && ((sensors >> 5) & 1 ) && ((sensors >> 6) & 1) && ((sensors >> 7) & 1))
	{
		//Turn ON Green LED for CH5
		HAL_GPIO_WritePin(CH5G_5_GPIO_Port, CH5G_5_Pin, GPIO_PIN_SET);
		//Turn Of Any Red LEDS, System is good.
		HAL_GPIO_WritePin(CH5R_1_GPIO_Port, CH5R_1_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH5R_2_GPIO_Port, CH5R_2_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH5R_3_GPIO_Port, CH5R_3_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH5R_4_GPIO_Port, CH5R_4_Pin, GPIO_PIN_RESET);
	}
	else
	{
		HAL_GPIO_WritePin(CH5G_5_GPIO_Port, CH5G_5_Pin, GPIO_PIN_RESET);
		//Each individual red led trigger CH5-1 -> CH1-1
		if(~(sensors >> 4) & 1)
		{
			HAL_GPIO_WritePin(CH5R_4_GPIO_Port, CH5R_4_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH5R_4_GPIO_Port, CH5R_4_Pin, GPIO_PIN_RESET);
		}
			
		if(~(sensors >> 5) & 1)
		{
			HAL_GPIO_WritePin(CH5R_3_GPIO_Port, CH5R_3_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH5R_3_GPIO_Port, CH5R_3_Pin, GPIO_PIN_RESET);
		}
		if(~(sensors >> 6) & 1)
		{
			HAL_GPIO_WritePin(CH5R_2_GPIO_Port, CH5R_2_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH5R_2_GPIO_Port, CH5R_2_Pin, GPIO_PIN_RESET);
		}
			
		if(~(sensors >> 7) & 1)
		{
			HAL_GPIO_WritePin(CH5R_1_GPIO_Port, CH5R_1_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH5R_1_GPIO_Port, CH5R_1_Pin, GPIO_PIN_RESET);
		}
	}
			if (((sensors >> 8) & 1) && ((sensors >> 9) & 1 ) && ((sensors >> 10) & 1) && ((sensors >> 11) & 1))
	{
		//Turn ON Green LED for CH4
		HAL_GPIO_WritePin(CH4G_4_GPIO_Port, CH4G_4_Pin, GPIO_PIN_SET);
		//Turn Of Any Red LEDS, System is good.
		HAL_GPIO_WritePin(CH4R_1_GPIO_Port, CH4R_1_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH4R_2_GPIO_Port, CH4R_2_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH4R_3_GPIO_Port, CH4R_3_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH4R_4_GPIO_Port, CH4R_4_Pin, GPIO_PIN_RESET);
	}
	else
	{
		HAL_GPIO_WritePin(CH4G_4_GPIO_Port, CH4G_4_Pin, GPIO_PIN_RESET);
		//Each individual red led trigger CH4-1 -> CH1-1
		if(~(sensors >> 8) & 1)
		{
			HAL_GPIO_WritePin(CH4R_4_GPIO_Port, CH4R_4_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH4R_4_GPIO_Port, CH4R_4_Pin, GPIO_PIN_RESET);
		}
			
		if(~(sensors >> 9) & 1)
		{
			HAL_GPIO_WritePin(CH4R_3_GPIO_Port, CH4R_3_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH4R_3_GPIO_Port, CH4R_3_Pin, GPIO_PIN_RESET);
		}
		if(~(sensors >> 10) & 1)
		{
			HAL_GPIO_WritePin(CH4R_2_GPIO_Port, CH4R_2_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH4R_2_GPIO_Port, CH4R_2_Pin, GPIO_PIN_RESET);
		}
			
		if(~(sensors >> 11) & 1)
		{
			HAL_GPIO_WritePin(CH4R_1_GPIO_Port, CH4R_1_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH4R_1_GPIO_Port, CH4R_1_Pin, GPIO_PIN_RESET);
		}
	}
	
	if (((sensors >> 12) & 1) && ((sensors >> 13) & 1 ) && ((sensors >> 14) & 1) && ((sensors >> 15) & 1))
	{
		//Turn ON Green LED for CH3
		HAL_GPIO_WritePin(CH3G_3_GPIO_Port, CH3G_3_Pin, GPIO_PIN_SET);
		//Turn Of Any Red LEDS, System is good.
		HAL_GPIO_WritePin(CH3R_1_GPIO_Port, CH3R_1_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH3R_2_GPIO_Port, CH3R_2_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH3R_3_GPIO_Port, CH3R_3_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH3R_4_GPIO_Port, CH3R_4_Pin, GPIO_PIN_RESET);
	}
	else
	{
		HAL_GPIO_WritePin(CH3G_3_GPIO_Port, CH3G_3_Pin, GPIO_PIN_RESET);
		//Each individual red led trigger CH3-1 -> CH1-1
		if(~(sensors >> 12) & 1)
		{
			HAL_GPIO_WritePin(CH3R_4_GPIO_Port, CH3R_4_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH3R_4_GPIO_Port, CH3R_4_Pin, GPIO_PIN_RESET);
		}
			
